{
    "version": "1.0",
    "truncation": {
        "max_length": 512,
        "strategy": "LongestFirst",
        "stride": 0
    },
    "padding": {
        "strategy": "BatchLongest",
        "direction": "Right",
        "pad_to_multiple_of": 8,
        "pad_id": 0,
        "pad_type_id": 0,
        "pad_token": "[PAD]"
    },
    "added_tokens": [
        {
            "id": 0,
            "special": true,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 1,
            "special": true,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 2,
            "special": true,
            "content": "[CLS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 3,
            "special": true,
            "content": "[SEP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        },
        {
            "id": 4,
            "special": true,
            "content": "[MASK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        }
    ],
    "normalizer": {
        "type": "BertNormalizer",
        "clean_text": true,
        "handle_chinese_chars": true,
        "strip_accents": null,
        "lowercase": true
    },
    "pre_tokenizer": {
        "type": "BertPreTokenizer"
    },
    "post_processor": {
        "type": "TemplateProcessing",
        "single": [
            {
                "SpecialToken": {
                    "id": "[CLS]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 0
                }
            }
        ],
        "pair": [
            {
                "SpecialToken": {
                    "id": "[CLS]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "B",
                    "type_id": 1
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 1
                }
            }
        ],
        "special_tokens": {
            "[CLS]": {
                "id": "[CLS]",
                "ids": [
                    2
                ],
                "tokens": [
                    "[CLS]"
                ]
            },
            "[SEP]": {
                "id": "[SEP]",
                "ids": [
                    3
                ],
                "tokens": [
                    "[SEP]"
                ]
            }
        }
    },
    "decoder": {
        "type": "WordPiece",
        "prefix": "##",
        "cleanup": true
    },
    "model": {
        "type": "WordPiece",
        "unk_token": "[UNK]",
        "continuing_subword_prefix": "##",
        "max_input_chars_per_word": 100,
        "vocab": {
            "[PAD]": 0,
            "[UNK]": 1,
            "[CLS]": 2,
            "[SEP]": 3,
            "[MASK]": 4,
            "1": 5,
            "2": 6,
            "3": 7,
            "4": 8,
            "5": 9,
            "6": 10,
            "7": 11,
            "8": 12,
            "9": 13,
            "10": 14,
            "11": 15,
            "12": 16,
            "13": 17,
            "14": 18,
            "15": 19,
            "16": 20,
            "17": 21,
            "18": 22,
            "19": 23,
            "20": 24,
            "21": 25,
            "22": 26,
            "23": 27,
            "24": 28,
            "25": 29,
            "26": 30,
            "27": 31
        }
    }
}